# GetComponentFill

## Description
Gets the fill of a component in an object.

```pascal
FUNCTION GetComponentFill(
				object         : HANDLE;
				componentIndex : INTEGER;
				VAR fill       : LONGINT) : BOOLEAN;
```

```python

def vs.GetComponentFill(object, componentIndex):
    return (BOOLEAN, fill)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, slab, roof face, roof, Wall Style, Slab Style, Roof Style, the Wall Preferences, the Slab Preferences, or the Roof Preferences.|
|componentIndex|INTEGER|The index of the component.|
|fill|LONGINT|Returns the fill of the component.  Positive values for patterns, negative ref numbers for hatches.|

## See Also
VS Functions:
SetComponentFill

## Version
Availability: from VectorWorks12.0
## Category
* Objects - Architectural